app/views/lists/show.html.haml

%ul
  - @list.list_entries.each do |e|
---
SELECT "list_entries".* FROM "list_entries" WHERE "list_entries"."list_id" = ?  [["list_id", 1]]