app/views/list_entries/_form.html.haml

      = f.label :speaker_id, 'Speakers'
      = f.collection_select :speaker_id, @speakers || Speaker.all, :id, :name
---
SELECT "speakers".* FROM "speakers"