app/controllers/discussions_controller.rb

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]
---
  def view
    @discussion = Discussion.find(params[:discussion_id])

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "discussions" SET "speakers" = ?, "updated_at" = ? WHERE "discussions"."id" = ?
---
  def push
    @discussion = Discussion.find(params[:discussion_id])
    @user = User.find(params[:user_id])
    @discussion.push @user