app/controllers/list_entries_controller.rb

SELECT "list_entries".* FROM "list_entries"
---
  def index
    @list_entries = ListEntry.all

INSERT INTO "list_entries" ("speaker_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["speaker_id", 1], ["list_id", 1], ["created_at", "2016-11-13 00:53:04.794979"], ["updated_at", "2016-11-13 00:53:04.794979"]]
---
  def create
    @list_entry = ListEntry.new(list_entry_params)

    respond_to do |format|
      if @list_entry.save

DELETE FROM "list_entries" WHERE "list_entries"."id" = ?  [["id", 1]]
---
  def destroy
    @list_entry.destroy

SELECT  "list_entries".* FROM "list_entries" WHERE "list_entries"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_list_entry
      @list_entry = ListEntry.find(params[:id])