app/controllers/lists_controller.rb

SELECT "speakers".* FROM "speakers"
---
  def show
    @list_entry = ListEntry.new list: @list
    @speakers = Speaker.all

INSERT INTO "lists" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Auditions, Night 1"], ["date", "2016-11-13 00:22:00.000000"], ["created_at", "2016-11-13 00:23:12.582226"], ["updated_at", "2016-11-13 00:23:12.582226"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save