app/controllers/speakers_controller.rb

INSERT INTO "speakers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jonah"], ["created_at", "2016-11-13 00:25:51.835527"], ["updated_at", "2016-11-13 00:25:51.835527"]]
---
  def create
    if @speaker.save